app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 1]]
---
  def index
    @blogs = current_user.blogs.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."publish" = 't'
---
  def list
    @blogs = Blog.where(:publish => true)

INSERT INTO "blogs" ("title", "body", "publish", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Blog"], ["body", "qwerrtyu"], ["publish", "f"], ["user_id", 1], ["created_at", "2016-05-21 05:56:42.468548"], ["updated_at", "2016-05-21 05:56:42.468548"]]
---
  def create
    @blog = current_user.blogs.new(blog_params)
    @blog.save

UPDATE "blogs" SET "publish" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["publish", "t"], ["updated_at", "2016-05-21 06:37:05.702971"], ["id", 1]]
---
  def update
    @blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])